app/Controllers/CatalogoController.php

    public function index()
    {
        $model = new ProductoModel();
        $productos = $model->findAll();
---
SELECT *
FROM `productos`