app/Controllers/Clientes.php

    public function index($usuarioId)
    {
        $clienteModel = new ClienteModel();
        $busqueda = $this->request->getGet('buscar');

        $query = $clienteModel->where('usuario_id', $usuarioId);

        if ($busqueda) {
            $query->groupStart()
                  ->like('nombre', $busqueda)
                  ->orLike('correo', $busqueda)
                  ->orLike('estatus', $busqueda)
                  ->groupEnd();
        }

        $data['clientes'] = $query->findAll();
---
SELECT *
FROM `clientes`
WHERE `usuario_id` = '2'

    public function edit($id)
    {
        $clienteModel = new ClienteModel();
        $data['cliente'] = $clienteModel->find($id);
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '1'

    public function update($id)
    {
        $clienteModel = new ClienteModel();
        $cliente = $clienteModel->find($id);

        $rules = [
            'nombre' => 'required',
            'correo' => 'required|valid_email',
            'telefono' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $clienteModel->update($id, [
            'nombre' => $this->request->getPost('nombre'),
            'correo' => $this->request->getPost('correo'),
            'telefono' => $this->request->getPost('telefono'),
            'estatus' => $this->request->getPost('estatus'),
        ]);
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '1'
UPDATE `clientes` SET `nombre` = 'Melany', `correo` = 'Me@gmail.com', `telefono` = '2212105960', `estatus` = 'activo', `updated_at` = '2025-06-11 19:16:48'
WHERE `clientes`.`id` IN ('1')