app/Controllers/Home.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $usuariosModel = new \App\Models\UsuariosModel();

        $busqueda = $this->request->getGet('buscar');

        if ($busqueda) {
            $usuariosModel->like('nombre', $busqueda)
                ->orLike('email', $busqueda);
        }

        $data['usuarios'] = $usuariosModel->findAll(); // 🔄 sin paginación