app/Controllers/ProductosController.php

    public function index($usuarioId)
    {
        $model = new ProductoModel();
        $productos = $model->where('usuario_id', $usuarioId)->findAll();
---
SELECT *
FROM `productos`
WHERE `usuario_id` = '1'

    public function store($usuarioId)
    {
        $validation = \Config\Services::validation();

        $rules = [
            'nombre'       => 'required|min_length[3]',
            'descripcion'  => 'required',
            'precio'       => 'required|decimal',
            'unidad'       => 'required',
            'categoria'    => 'required',
            'estatus'      => 'required|in_list[activo,inactivo]',
            'archivo'      => 'uploaded[archivo]|max_size[archivo,2048]|ext_in[archivo,jpg,jpeg,png,pdf,docx]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // ⚠️ Verificar que el usuario exista
        $usuarioModel = new UsuariosModel();
        $usuario = $usuarioModel->find($usuarioId);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'

        $archivo->move(ROOTPATH . 'public/uploads', $nombreArchivo);

        $model = new ProductoModel();
        $model->save([
            'usuario_id'  => $usuarioId,
            'nombre'      => $this->request->getPost('nombre'),
            'descripcion' => $this->request->getPost('descripcion'),
            'precio'      => $this->request->getPost('precio'),
            'unidad'      => $this->request->getPost('unidad'),
            'categoria'   => $this->request->getPost('categoria'),
            'estatus'     => $this->request->getPost('estatus'),
            'archivo'     => $nombreArchivo
        ]);
---
INSERT INTO `productos` (`usuario_id`, `nombre`, `descripcion`, `precio`, `unidad_medida`, `categoria`, `estatus`, `archivo`) VALUES ('2', 'Bocina Inteligente Alexa', 'Bocina Inteligente Alexa Echo Pop Morado', '699', 'Pieza', 'Componentes ', 'activo', '1750263869_f62511384989fc952e08.png')

    public function edit($id)
    {
        $model = new ProductoModel();
        $producto = $model->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'

    public function update($id)
    {
        $model = new ProductoModel();
        $producto = $model->find($id);

        if (!$producto) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Producto no encontrado.");
        }

        $archivo = $this->request->getFile('archivo');
        $nombreArchivo = $producto['archivo'];

        if ($archivo && $archivo->isValid()) {
            $nombreArchivo = $archivo->getRandomName();
            $archivo->move(ROOTPATH . 'public/uploads', $nombreArchivo);
        }

        $model->update($id, [
            'nombre'      => $this->request->getPost('nombre'),
            'descripcion' => $this->request->getPost('descripcion'),
            'precio'      => $this->request->getPost('precio'),
            'unidad'      => $this->request->getPost('unidad'),
            'categoria'   => $this->request->getPost('categoria'),
            'estatus'     => $this->request->getPost('estatus'),
            'archivo'     => $nombreArchivo
        ]);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'
UPDATE `productos` SET `nombre` = 'Chetos', `descripcion` = 'para mancharse los dedos', `precio` = '15.00', `unidad_medida` = NULL, `categoria` = 'frituras', `estatus` = 'activo', `archivo` = '1750109373_4bf3604f0ebc2e3bc8e8.png', `updated_at` = '2025-06-16 21:29:33'
WHERE `productos`.`id` IN ('1')