app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $usuariosModel = new \App\Models\UsuariosModel();

        $busqueda = $this->request->getGet('buscar');

        if ($busqueda) {
            $usuariosModel->like('nombre', $busqueda)
                ->orLike('email', $busqueda);
        }

        $data['usuarios'] = $usuariosModel->findAll(); // 🔄 sin paginación

SELECT *
FROM `usuarios`
---
    public function new()
    {

        $usuariosModel = new UsuariosModel(); //retorna los registros de usuarios
        $data['usuarios'] = $usuariosModel->findAll(); //un arreglo llamado usuarios que busca todos los datos de la bd

INSERT INTO `usuarios` (`nombre`, `email`, `contraseña`, `fecha_crea`, `fecha_actu`) VALUES ('Maruchan', 'marucha@gmail.com', '$2y$10$uKT1EhISH0HNykXWvR0W.eyS3RvbtnAb6PJ/IZz2.XLOIm5h1AukW', '2025-06-04 18:33:05', '2025-06-04 18:33:05')
---
    public function create()
    {
        $reglas = [
            'nombre' => 'required|min_length[3]',
            'email' => [
                'rules' => 'required|valid_email|is_unique[usuarios.email]',
                'errors' => ['is_unique' => 'El correo electrónico ya está en uso.']
            ],
            'contraseña' => [
                'rules' => [
                    'required',
                    'min_length[8]',
                    'regex_match[/^(?=.*[A-Z])(?=.*\d)(?=.*[\W_]).+$/]'
                ],
                'errors' => [
                    'regex_match' => 'La contraseña debe tener al menos una mayúscula, un número y un carácter especial.'
                ]
            ],
            'confirmar' => 'required|matches[contraseña]'
        ];

        if (!$this->validate($reglas)) {
            return redirect()->back()->withInput()->with('error', $this->validator->listErrors());
        }

        $post = $this->request->getPost(['nombre', 'email', 'contraseña']);

        $usuariosModel = new UsuariosModel();

        $usuariosModel->insert([
            'nombre' => trim($post['nombre']),
            'email' => trim($post['email']),
            'contraseña' => password_hash(trim($post['contraseña']), PASSWORD_DEFAULT)
        ]);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '2'
---
    public function edit($id = null) //recibe un id y sino lo recibe lo deja como nulo
    {
        if ($id == null) {  //validacion por si es nullo se regresa al index
            return redirect()->to('usuarios');
        }

        $usuariosModel = new UsuariosModel();
        $data['usuario'] = $usuariosModel->find($id);

UPDATE `usuarios` SET `nombre` = 'Manuel', `email` = 'manu@gmail.com', `contraseña` = '$2y$10$tJ56CkH7UORPJ1NjIiK6m.L2f7TAWLghPUx7iZGiEZ4wZwpDnImmC', `fecha_actu` = '2025-06-04 18:35:23'
WHERE `usuarios`.`id` IN ('2')
---
                $updateData['contraseña'] = password_hash($data['contraseña'], PASSWORD_BCRYPT);
            }

            $usuariosModel->update($id, $updateData);